{
    "version": "https://jsonfeed.org/version/1",
    "title": "James Koole",
    "description": "",
    "home_page_url": "https://www.jameskoole.com",
    "feed_url": "https://www.jameskoole.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "James Koole"
    },
    "items": [
        {
            "id": "https://www.jameskoole.com/an-epic-cross-canada-journey/",
            "url": "https://www.jameskoole.com/an-epic-cross-canada-journey/",
            "title": "An Epic Cross-Canada Journey",
            "summary": "It was all supposed to be pretty easy. Our kid Lindsey (they/them), a first-year engineering student at UVic, would catch AC1902 from Victoria International Airport (YYJ) to Toronto Pearson International Airport (YYZ) on the Tuesday before Christmas to come home for a couple of weeks.",
            "content_html": "<p>It was all supposed to be pretty easy. Our kid Lindsey (they/them), a first-year engineering student at UVic, would catch AC1902 from Victoria International Airport (YYJ) to Toronto Pearson International Airport (YYZ) on the Tuesday before Christmas to come home for a couple of weeks.</p>\n<p>A few days before that flight, we started seeing some interesting weather forecasts that called for things like 20cm of snow or worse for Victoria, BC. That seemed unlikely given Victoria’s history with snow and so we didn’t think a whole lot of it. Until Monday.</p>\n<p>That morning it was pretty clear that Tuesday might be a bit on the messy side and that getting to the airport would be challenging. We weren’t even sure the flight would go if the weather turned out the way the forecasters were predicting.</p>\n<h3 id=\"the-first-hurdle\">The First Hurdle</h3>\n<p>On Tuesday morning, Lindsey woke up to 30cm of snow on the ground and a real problem. The entire transit system in Victoria was shut down along with basically every thing else in the city. Somehow AC1902 still showed as “on time”. It seemed inevitable that it would be cancelled.</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://www.jameskoole.com/uploads/2023/8e76712ab8.jpg\" alt=\"A view of a snowy UVic campus.\"  data-is-external-image=\"true\"></figure></p>\n<p>Beautiful, but unwanted. Victoria is not prepared for this much snow.</p>\n<p>Taxis were impossible to find as most drivers weren’t out on the roads. Nobody picked up the phone and ordering online just resulted in an endless wait or an immediate cancellation. I tried finding a ride on Reddit and by calling in a favour with a friend in Victoria, but neither were successful as the streets were basically impassable.</p>\n<p>By late morning it was clear that getting to YYJ wasn’t possible. The flight now showed “diverted” to Calgary (YYC) first before Toronto and delayed for hours, but it wasn’t possible to get to the Victoria airport to catch it. We got on the phone with Air Canada and I started searching for alternatives. Believe it or not, that plane eventually did make it to Toronto.</p>\n<h3 id=\"a-friday-backup\">A Friday Backup</h3>\n<p>I managed to book the same flight (AC1902) for Friday at great expense, but it seemed like our only option at this point. After nearly three hours on hold, we spoke with a very helpful Air Canada agent who cancelled our Tuesday flight and graciously swapped in our Friday flight at the same price rather than then $1,280 I had paid to book it.</p>\n<p>We thought maybe that was how it would play out. Lindsey would stick around Victoria until Friday and then fly home. But then the storm watches started popping up for Toronto starting on Thursday and through Friday and Saturday.</p>\n<h3 id=\"despair-to-hope\">Despair to Hope!</h3>\n<p>On Wednesday I talked to Lindsey on FaceTime and we talked about how tough it was there. Most of their friends had left for Christmas break on flights or ferries to the mainland and the campus was still closed and the city mostly shutdown by the snow. It was going to be a boring, depressing few days. Tears were shed.</p>\n<p>I did a bit more clicking around and working the Air Canada website, learning how flights pop in and out as people book and cancel their flights. Eventually I was able to snag a flight on Thursday morning from YYJ to Vancouver International Airport (YVR) and then a three hour layover before a flight to YYZ at 3:00 P.M.</p>\n<p>I was excited to tell Lindsey the new plan and, as expected, it was just the bit of news needed to get through the rest of that day.</p>\n<h3 id=\"looking-promising\">Looking Promising!</h3>\n<p>We thought we were home free now. Lindsey was excited to have an end date for the time on campus and it looked like the Thursday flight would be out of Vancouver well before the coming storm in Toronto that was supposed to start late Thursday and really develop on Friday morning.</p>\n<p>We had the Friday flight in our back pocket and I booked yet another ticket on Saturday’s AC1902. Worst case, we thought, we would have Lindsey home for Christmas although the thought of being in Victoria until the weekend was not appealing and the dorms were closing on Friday afternoon meaning there was no place to live and no dining hall to get food at.</p>\n<h3 id=\"another-snowy-surprise\">Another Snowy Surprise</h3>\n<p>On Thursday there was more snow in Victoria. We tried the cab option again at 6:00 A.M. but it was clear that wasn’t working. BC Transit was running again finally and so Lindsey trudged through the snow with a big suitcase and caught a bus from the UVic bus loop towards downtown where another bus would meet up to go up near the airport.</p>\n<p>That went decently well and Lindsey was within 1.7km of the terminal a little under two hours before the departure. Flights were leaving on time and the plane that would become the flight to Vancouver was at YVR and on-time to come over to YYJ.</p>\n<p>The bus never showed but they were able to order a cab from the airport just five minutes away that got them there in time to check in. Things were looking very hopeful! Flights were on time and the weather in Toronto was good.</p>\n<h3 id=\"its-all-gone-wrong-again\">It’s All Gone Wrong AGAIN</h3>\n<p>Then the YYJ to YVR flight was abruptly cancelled. No flight crew was the reason. We were screwed. The only option provided for rebooking was on Christmas Day. We took it because “why not” and added that to the list of flights we had booked. We also learned that we were eligible for significant compensation for the cancellation of this flight because the reason was deemed to be within the control of the airline.</p>\n<h3 id=\"a-new-hope\">A New Hope!</h3>\n<p>I fired up the Air Canada website again and got to work. I fairly quickly snagged a red-eye from YVR to YYZ departing at 11:55 P.M. It wasn’t cheap, but it was an option. We huddled up over FaceTime and decided to leave the island on the next ferry and get to YVR and hope this red-eye went.</p>\n<p>Lindsey took a cab to the ferry terminal and got a walk-on ticket for the 11:00 A.M. ferry to Tsawwassen south of Vancouver. I got on the phone with my running buddy Miguel who happened to be in Vancouver. He’s one of the nicest people I know, a great friend, and someone who is always willing to give of himself to help others.</p>\n<p>I called in a <em>big</em> favour - could he drive an hour down from North Vancouver, pick up Lindsey at the Tsawwassen terminal and then take them to YVR? And if the flight was cancelled, could he give Lindsey a place to sleep for the night?</p>\n<p>Yes. Of course. No question.</p>\n<p>Lindsey was on the ferry now and we were committed to the Vancouver option for getting home. That move cut off our AC1902 flight options for Friday at least, and probably Saturday as well since catching those would then involve heading back to the island on the ferry.</p>\n<p>But we were willing to risk that given the greater options for flights to Toronto from YVR and the fact that we had a friend on the mainland to provide a place to stay if needed.</p>\n<h3 id=\"even-better\">Even Better!</h3>\n<p>Just as the ferry left the dock in Swartz Bay, I was able to snag yet another flight. This one was YVR to YYZ departing that evening at 5:45 P.M. Lindsey could get to YVR with the help of a pickup from Miguel and the inbound flight to YVR was already in the air and on-time. This looked very promising!</p>\n<p>The ferry was delayed a bit, but Miguel was waiting to provide the ride to YVR. Lindsey got there in plenty of time to check in, drop their big suitcase (finally) and get through the security lines. Then it was a waiting game to see if the flight actually went.</p>\n<p>We were really starting to feel hopeful at this point. The flight was on time, the weather in Toronto was holding and it wasn’t going to be snowy and windy until Friday morning. We had the red-eye in our back pocket. I had booked yet another flight for Friday afternoon from YVR to YYZ as the final backup plan.</p>\n<p>At this point I was feeling good. We had six separate flights booked from two different airports to Toronto. Lindsey was checked into two flights on Thursday night and both were still showing as either on time or slightly delayed.</p>\n<h3 id=\"heading-home\">Heading Home</h3>\n<p>By 5:55 P.M. Vancouver time, Lindsey was on the plane. It was snowing a bit in Vancouver but it seemed like it was all going to work out. A stressful 55 minutes later, the flight finally took off heading to Toronto.</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://www.jameskoole.com/uploads/2023/026515f7db.jpg\" alt=\"A view out the window of an airplane with a snowy apron and baggage cart in the foreground.\"  data-is-external-image=\"true\"></figure></p>\n<p>A great view.</p>\n<p>I got to work cancelling flights now. First was the red-eye, then the Friday flight from YVR to Toronto. I imagined someone like me on the Air Canada website snagging that seat or someone on standby getting a spot and rejoicing that they maybe had a new hope to get home. Then I cancelled the Saturday YYJ to YYZ flight. Lastly the Christmas Day flights were cancelled.</p>\n<p>These were all fully-refundable fares so the money was coming back to the credit card in big piles and the stress of the whole experience was finally melting away. There was one last flight in our bookings – the Friday YYJ to YYZ flight that was our original “backup” plan.</p>\n<h3 id=\"a-bit-of-sleep\">A Bit of Sleep</h3>\n<p>We went to bed for a few hours but set an alarm for 1:30 A.M. so my wife Ginny and older daughter Mackenzie and I could all drive out to YYZ to pick up Lindsey. The flight landed while we were driving out to the airport and we parked at Terminal 1 and went inside to the baggage area.</p>\n<p>We waited for Lindsey to de-plane which took a while because there were no ground crews to bring the plane to the gate. Finally Lindsey came through the doors from the gates area and we were able to greet them with hugs and some tears. We did it!</p>\n<p>The luggage hall was a bit of a disaster zone. There were suitcases everywhere and people standing around as well as sleeping on the few seats and on the floor. Every time a baggage carousel started up, there were cheers.</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://www.jameskoole.com/uploads/2023/bfd883b835.jpg\" alt=\"A wide angle of the baggage hall at Toronto Pearson Airport with suitcases stacked up by the dozens.\"  data-is-external-image=\"true\"></figure></p>\n<p>Unclaimed suitcases everywhere.</p>\n<p>Meanwhile we got a notification from Air Canada that the Friday flight from YYJ to YYZ had been cancelled. That was the news we were hoping for as it turned our non-refundable ticket into a fully refundable one. We cancelled the last remaining flight and got the last of our money back (aside from money for the flight that Lindsey did take).</p>\n<p>At about 4:00 A.M. an announcement was made that the bags weren’t coming and there were no baggage handlers until after 6:00 A.M.</p>\n<p>People were…unimpressed. But we just decided that we would head home and get Lindsey home to bed after a long day. We’d go back after 6:30 A.M. and hopefully retrieve the suitcase. It’s about a 30 minute drive each way, so we got to the house just past 4:40 A.M. and into bed before 5:00 A.M.</p>\n<p>We got about an hour more sleep before we got back up to head back to Pearson to get the suitcase with all the clothes and everything else Lindsey brought back. Ginny ran in while I looped around the terminal roads. The bag was there and we were all set.</p>\n<p>We got home at about 7:30 A.M. and the mission was fully accomplished. Lindsey was asleep in their bedroom and the suitcase was in the hallway.</p>\n<h3 id=\"an-epic-christmas-travel-story\">An Epic Christmas Travel Story</h3>\n<p>That’s the story of what was an epic adventure to get home for Christmas around three major storms and many challenges.</p>\n<p>We were thankful that we had the financial resources to book all these flights along with the technical abilities to work the Air Canada website.</p>\n<p>We were thankful for FaceTime calls so we could speak face to face and commiserate or plan next steps and support each other through a very stressful time.</p>\n<p>I was thankful for the Apple FindMy app that let me see where Lindsey was and help navigate the BC Transit ride with live bus tracking from the Transit app.</p>\n<p>We literally couldn’t have done it without the help of a good friend who dropped everything to lend a hand. Thank you Miguel.</p>\n<p>And lastly, we were grateful to everyone at Air Canada, BC Ferries, BC Transit, all the baggage handlers, aircraft maintenance workers, and everyone else who was working extremely hard under tough circumstances to get as many people to where they wanted to go as possible.</p>\n<p>Merry Christmas everyone.</p>\n",
            "author": {
                "name": "James Koole"
            },
            "tags": [
            ],
            "date_published": "2022-12-23T14:49:00-05:00",
            "date_modified": "2023-02-28T14:49:52-05:00"
        },
        {
            "id": "https://www.jameskoole.com/packing-patience/",
            "url": "https://www.jameskoole.com/packing-patience/",
            "title": "Packing Patience",
            "summary": "Travel is stressful at the best of times, but when things like bad weather get thrown into the mix, it can get very overwhelming really quickly. Our kid was supposed to be flying home from Victoria, BC tonight. In fact, I should have been on&hellip;",
            "content_html": "<p>Travel is stressful at the best of times, but when things like bad weather get thrown into the mix, it can get very overwhelming really quickly.</p>\n<p>Our kid was supposed to be flying home from Victoria, BC tonight. In fact, I should have been on the way to the airport to pick her up as I write this. Except that Victoria got 30cm of snow overnight and that basically shut the city down.</p>\n<p>30cm of snow on the UVic campus. Not something Victoria is set up to deal with.\nThe issue wasn’t so much with the airport or the flight. It actually departed four hours late and to a different city for a stopover (Calgary) for some reason. The problem was that it was impossible to get to the airport because the transit system was shut down and there were no cabs out on the roads either.</p>\n<p>We tried this morning to arrange for a ride, to get a cab or to otherwise find a way to get to the airport, but by the original flight time, it was clear that getting to the airport was not possible.</p>\n<h3 id=\"to-the-phone\">To the Phone!</h3>\n<p>We got on the phone with Air Canada to see what the options were and needless to say, with large numbers of flights in both Victoria and Vancouver cancelled, some time was going to be spent on hold. I actually had lunch with some work friends and took the train back home before a human picked up.</p>\n<p>In the meantime, I started looking at various other flights tomorrow and beyond to see if we could spend our way out of the situation. I was watching as seats were booked and prices rose and options went from ridiculously expensive to completely unaffordable.</p>\n<p>Victoria is not a big city and the airport doesn’t see many flights a day. There is just one non-stop to Toronto and then a bunch of flights between various cities in BC. Flights were very limited as most everything was already booked thanks to the Christmas holidays coming up. We considered whether the ferry or even a float plane to Vancouver to fly from there was an option. Since Vancouver airport was also slammed, there were few options there either.</p>\n<p>I eventually booked a very expensive flight on Friday with Air Canada (fully refundable) and hoped that the original flight would be cancelled so we could get some of our money back. Happily, we eventually got an Air Canada customer service person on the phone after well over two hours of waiting and she was able to cancel our original booking (even though the flight wasn’t cancelled), take over the seat I had booked (and refunded us for that flight).</p>\n<h3 id=\"hashtag-winning\">Hashtag Winning</h3>\n<p>The net result of all this is that we have a flight booked for Friday morning and the change was made without charge to us. That’s pretty decent considering the original booking was a “basic” fare with no refunds or changes and that flight wasn’t cancelled.</p>\n<p>I also booked a fully refundable ticket for the Saturday flight just in case. The weather in Toronto isn’t looking great for Thursday or Friday and the last thing we need is for the Friday flight to get cancelled and have zero options to get the kid home before Christmas.</p>\n<h3 id=\"calm-and-collected\">Calm and Collected</h3>\n<p>The biggest lesson I’ve learned in my many years of dealing with messy situations like this is to be patient. It’s really easy to get super frustrated and to take it out on the people who are trying to help you. If you keep a level head, it often works out far better than trying to yell your way out of a bad situation.</p>\n<p>The people at Air Canada (or WestJet or any other airline) are trying their best and really want to get you to where you are trying to go. Working with them and being flexible will often result in a good outcome. In our case, we explained our situation, said we had booked a new refundable fare on Friday and asked what our options were for the ticket we had.</p>\n<p>The customer service person was excellent and spent fifteen minutes with us on the phone moving things around, re-booking seats, cancelling check-ins and fixed us up. I’m willing to bet that had we gone into that call demanding to fly home ASAP that we wouldn’t have been blessed with the same outcome.</p>\n<p>Remember that the companies you deal with are made up of humans who don’t need to be treated as anything less than a human. Things happen. Snow falls, planes break down and not everything can go as planned 100% of the time.</p>\n<p>Pack your patience and treat people the way you would want to be treated if you were the unfortunate one on the other end of the phone line and you’ll see that things will often work out.</p>\n",
            "author": {
                "name": "James Koole"
            },
            "tags": [
            ],
            "date_published": "2022-12-22T14:48:00-05:00",
            "date_modified": "2023-02-28T14:49:07-05:00"
        },
        {
            "id": "https://www.jameskoole.com/vivaldi/",
            "url": "https://www.jameskoole.com/vivaldi/",
            "title": "Vivaldi",
            "summary": "I was a devoted Firefox user for many years but recently, the list of annoyances with Firefox started to pile up. Some of this is self-inflicted like the Proton redesign that changed the UI for the tabs in what I thought was a step backwards.",
            "content_html": "<p>I was a devoted Firefox user for many years but recently, the list of annoyances with Firefox started to pile up.</p>\n<p>Some of this is self-inflicted like the Proton redesign that changed the UI for the tabs in what I thought was a step backwards. Google also started to purposefully break things on Firefox including stuff like background blur on Meet calls and fullscreen viewing in YouTube.</p>\n<p>I switched to Brave for a year or so and enjoyed that browser quite a bit. It’s Chromium underneath meaning that it shares the open source core that Chrome is built upon. Extension support is excellent and the look and feel is nice.</p>\n<p>But Brave comes with a weird crypto play called Brave Rewards built around the Basic Attention Token (BAT) which is a cryptocurrency coin. You can disable all that stuff, but it’s not something I think belongs in a browser.</p>\n<p>That left me looking for something new. I tried Safari but the lack of good extensions (especially for ad blocking) made that a non-starter. Orion is a new browser that looks a lot like Safari but adds Chrome/Firefox extension support. It’s in beta and it shows – it’s far too buggy to be an everyday browser.</p>\n<p>Microsoft offers Edge that is also built around Chromium, but like Brave, they layer on a whole load of unwanted stuff. In the case of Edge, there’s shopping and other crapware built in that I don’t want.</p>\n<p>What’s left? Vivaldi.</p>\n<p>I’ve resisted Vivaldi a bit over the years because I don’t like the look and feel of it. I find the tabs and icons to be a bit weird looking, especially on the Mac. But I thought I would give it another go, partly because I like the direction things are going with Vivaldi but also because I learned that the UI is quite customizable.</p>\n<p>Vivaldi’s UI is built using HTML and CSS meaning you can tweak things to your liking (to a certain extent). I’m not doing a whole lot, but I added a bit of padding on the left side of the bookmarks bar and bumped up the font size a half a pixel to make it look just a bit better to my eye.</p>\n<p>One thing I still don’t like is that the tabs in Vivaldi are a touch narrower than I would prefer. I haven’t been able to figure out how to add some width yet, but I suspect it’s possible with the right CSS bits.</p>\n<p>I’ve deleted all the other browsers from my laptop (except Safari) and I’m using Vivaldi full time now. So far so good.</p>\n",
            "author": {
                "name": "James Koole"
            },
            "tags": [
                   "Open Web"
            ],
            "date_published": "2022-12-11T14:47:00-05:00",
            "date_modified": "2023-02-28T14:47:25-05:00"
        },
        {
            "id": "https://www.jameskoole.com/uses-for-a-synology/",
            "url": "https://www.jameskoole.com/uses-for-a-synology/",
            "title": "Uses for a Synology",
            "summary": "I got my hands on a Synology DS920+ a couple of years ago. It has two Seagate Ironwolf 4TB drives in it meaning I have a few TB of backup space sitting on my desk in the basement. But besides backing up your files, photos or computers, what else&hellip;",
            "content_html": "<p>I got my hands on a <a href=\"https://www.synology.com/en-ca\">Synology DS920+</a> a couple of years ago. It has two <a href=\"https://www.seagate.com/ca/en/products/nas-drives/ironwolf-hard-drive/\">Seagate Ironwolf</a> 4TB drives in it meaning I have a few TB of backup space sitting on my desk in the basement. But besides backing up your files, photos or computers, what else is a Synology good for?</p>\n<ol>\n<li><strong>Plex Server</strong> - I run a <a href=\"https://www.plex.tv/\">Plex home media server</a> on my Synology along with Sonarr and Deluge (in Docker to pull down shows automatically). I generally use this to run a home PVR, downloading mostly stuff I could already get with my cable package. The downloads are nice though because there are no commercials.</li>\n<li><strong>Homebridge</strong> - I also have a <a href=\"https://homebridge.io/\">Homebridge server</a> running that bridges my non-HomeKit smart home devices over to the HomeKit world. You can <a href=\"https://www.jameskoole.com/wading-into-homekit/\">read more</a> about my Homebridge and HomeKit setup if you want.</li>\n<li><strong>OpenVPN</strong> - one of the best uses for a home server is running your own VPN. With <a href=\"https://openvpn.net/community-downloads/\">OpenVPN</a>, I can connect back to my home network (and internet connection) from virtually anywhere in the world. That means secure connections on public wifi and also access to shows and services like Bell Fibe TV from outside Canada since the data actually flows through my home internet IP.</li>\n<li><strong>Photo backup</strong> - I have my entire Lightroom library of photos backed up to my Synology in addition to being in Adobe Creative Cloud. It gives me some peace of mind in case something were to go badly with the cloud service.</li>\n</ol>\n<p>Some other uses for a Synology include acting as a Apple Time Machine backup destination. Since the Synology is networked, it can be a great solution for providing storage for multiple computers in the household.</p>\n<p>It's also possible to run your own Dropbox-type solution via apps like <a href=\"https://owncloud.com/\">OwnCloud</a>. You can even host a WordPress blog and your own email server if that's your thing.</p>",
            "author": {
                "name": "James Koole"
            },
            "tags": [
            ],
            "date_published": "2022-12-04T14:45:00-05:00",
            "date_modified": "2023-02-28T14:46:50-05:00"
        },
        {
            "id": "https://www.jameskoole.com/algos-photos-and-social/",
            "url": "https://www.jameskoole.com/algos-photos-and-social/",
            "title": "Twitter for News and Information",
            "summary": "Do I miss Twitter? Not really. There are a few things that bring me back occasionally to do a search. Mostly it’s real-time news or information, including breaking news events like earthquakes or plane crashes. It’s also things like updates from our transit service on&hellip;",
            "content_html": "<p>Do I miss Twitter? Not really.</p>\n<p>There are a few things that bring me back occasionally to do a search. Mostly it’s real-time news or information, including breaking news events like earthquakes or plane crashes. It’s also things like updates from our transit service on diversions and closures.</p>\n<p>Over time as more and more people join Mastodon, there will invariably be more of that kind of information away from Twitter as well. A bot sort of provides re-posts of the transit information in Toronto, but it’s not all that reliable. I might just create my own with a combination of the various services I want all in a single Mastodon account.</p>\n<p>When Twitter started, it didn’t have all this stuff either and it took a long time before it became the place the world went for information and news. Mastodon will get there eventually.</p>\n",
            "author": {
                "name": "James Koole"
            },
            "tags": [
                   "Open Web"
            ],
            "date_published": "2022-11-27T15:21:00-05:00",
            "date_modified": "2023-02-28T14:44:47-05:00"
        },
        {
            "id": "https://www.jameskoole.com/thanks-elon/",
            "url": "https://www.jameskoole.com/thanks-elon/",
            "title": "Wading into Homekit",
            "summary": "I’ve had a few “smart” devices around the house, but generally they all used Amazon Alexa for control and not Apple’s HomeKit. But with the recent updates to HomeKit (coming in iOS 16.2) and the news that Amazon is losing mega money on Alexa, I&hellip;",
            "content_html": "<p>I’ve had a few “smart” devices around the house, but generally they all used Amazon Alexa for control and not Apple’s HomeKit. But with the recent updates to HomeKit (coming in iOS 16.2) and the news that Amazon is losing mega money on Alexa, I decided to give HomeKit a try.</p>\n<p>I don’t have the most complicated setup:</p>\n<ol>\n<li>Logitech Circle 2 camera - front porch.</li>\n<li>Wyze Cam v2 camera - floats around as needed.</li>\n<li>Wyze plugs (2) - desk lamp and other things as needed.</li>\n<li>Wemo plug - fan.</li>\n<li>TP-Link outdoor two outlet plug - Christmas lights.</li>\n<li>Wyze Colour bulbs (6) - basement lights, front porch light.</li>\n<li>Ecobee - smart thermostat.</li>\n</ol>\n<p>Three of those devices have HomeKit support built in - the Logitech Circle 2, the Wemo plug and the Ecobee. Adding them to HomeKit was a snap. The rest doesn’t have HomeKit support so that meant I needed a solution for all the Wyze gear and the TP-Link plug.</p>\n<h3 id=\"homebridge\">Homebridge</h3>\n<p>That solution was <a href=\"https://homebridge.io/\">Homebridge</a> which is a server application that builds bridges between non-HomeKit devices and HomeKit. It runs on a server like a Raspberry Pi, or a Mac mini. In my case, it’s running on my <a href=\"https://www.synology.com/en-ca/products\">Synology</a> DS920+ NAS.</p>\n<p>Set up was a little complicated, but not ridiculously so. Homebridge was easy to setup and get added into HomeKit. Once that was done, it was a matter of adding the plugins to Homebridge that I needed for my specific devices.</p>\n<p>I used <a href=\"https://github.com/jfarmer08/homebridge-wyze-smart-home\">Homebridge Wyze Smart Home</a> and <a href=\"https://github.com/plasticrake/homebridge-tplink-smarthome#readme\">TP-Link Smart Home</a>. That took care of the bulbs and plugs plus the outdoor dual plug. That left just the Wyze Cam v2 which needed a different plugin. I used <a href=\"https://github.com/Sunoo/homebridge-camera-ffmpeg#readme\">Homebridge Camera FFmpeg</a> for that which required the Wyze Cam v2 to have the RTSP firmware (which I had already installed on mine).</p>\n<h3 id=\"homekit-hub\">HomeKit Hub</h3>\n<p>HomeKit also requires a Hub for all this to work. That hub can be either a HomePod mini or an AppleTV. I opted to get a new <a href=\"https://www.apple.com/apple-tv-4k/\">AppleTV 4K</a> as I only had an older 3rd generation AppleTV around and it doesn’t offer full support for HomeKit.</p>\n<p>Everything is all set up now and I can see my two cameras in the Home app. Plus everything is controllable via the app, by talking to Siri and also using HomeKit automations. That last part is really exciting to me as I’ll be able to do things like have lights turn off and on as people leave and arrive back home.</p>\n<p>I’ll probably swap out the Wyze stuff over time for Philips Hue or something else. But until then, Homebridge does a great job bridging the non-HomeKit devices and the HomeKit world.</p>\n",
            "author": {
                "name": "James Koole"
            },
            "tags": [
                   "Technology"
            ],
            "date_published": "2022-11-26T12:54:00-05:00",
            "date_modified": "2023-02-28T14:44:13-05:00"
        },
        {
            "id": "https://www.jameskoole.com/switching-instances/",
            "url": "https://www.jameskoole.com/switching-instances/",
            "title": "Some Mastodon Tips",
            "summary": "I’ve been full-time on Mastodon for a week or three now and don’t really use Twitter anymore. I check there every now and then, but I don’t follow anyone or post there. In my time on Mastodon, I’ve noticed some things that are very similar&hellip;",
            "content_html": "<p>I’ve been full-time on Mastodon for a week or three now and don’t really use Twitter anymore. I check there every now and then, but I don’t follow anyone or post there.</p>\n<p>In my time on Mastodon, I’ve noticed some things that are very similar to Twitter, but also a few things that are a little bit different. Here’s a few notes if you are just wading in.</p>\n<ul>\n<li>If you are on an instance that is not “general” and aligns with your interests, then the Local Timeline is worthwhile to look at. You can find new people to follow or at least see everything that is posted across your entire instance. If you are on a huge instance like mastodon.social, it’s not as great.</li>\n<li>The Federated Timeline is a little bit bananas. If you were on Twitter back in 2006-2007, then you might remember that you used to be able to just watch literally ALL the tweets go by. The Federated Timeline is like that and it’s exactly what you would imagine.</li>\n<li>DMs are different than on Twitter. If you have a DM conversation going between you and someone else, and then you mention a third person, they get pulled into that chat and can see the previous messages in the conversation. So be careful with that.</li>\n<li>Posts (sometimes called Toots) have different options between public and private. You can post public posts, unlisted (like public, but they don’t show up in searches), followers only and @mentioned only.</li>\n<li>Hashtags really matter on Mastodon. Search is generally best with hashtags so if you want your posts to be found, sprinkle a few #hashtags through your #posts and enjoy some increased #engagement.</li>\n</ul>\n<p>I’ve noticed significantly more conversation happening on Mastodon. I’m pretty sure that the majority of Twitter users don’t read or even see a lot of the tweets of the people they follow thanks to the algorithmic view that Twitter forces on users.</p>\n<p>It’s also clear to me that a high percentage of Twitter followers aren’t even there anymore. You might have 200 followers, but 100 of them no longer use Twitter, and when you Tweet, perhaps ten of your followers actually see what you posted.</p>\n<p>On Mastodon, it’s far more likely that a higher percentage of your followers are actually using the service and will also actually see your posts.</p>\n",
            "author": {
                "name": "James Koole"
            },
            "tags": [
                   "Open Web"
            ],
            "date_published": "2022-11-25T20:56:00-05:00",
            "date_modified": "2023-02-28T14:43:25-05:00"
        },
        {
            "id": "https://www.jameskoole.com/day-trips-to-run/",
            "url": "https://www.jameskoole.com/day-trips-to-run/",
            "title": "Does Mastodon Need Twitter to Die to Succeed?",
            "summary": "Is Twitter dying? I don’t think it matters anymore. Mastodon is growing and people are discovering that there is an alternative social network to the bird site owned by the egomaniac billionaire. I believe Mastodon has nearly reached a critical mass or inflection point where&hellip;",
            "content_html": "<p>Is Twitter dying? I don’t think it matters anymore. Mastodon is growing and people are discovering that there is an alternative social network to the bird site owned by the egomaniac billionaire.</p>\n<p>I believe Mastodon has nearly reached a critical mass or inflection point where it can go from fringe alternative for geeks and nerds and will become something that anyone can, and will use.</p>\n<p>The average person has now at least <em>heard</em> of Mastodon. They know it’s a Twitter-like service. They’ve heard of the fediverse and at least have a sense of how Mastodon is different from the centralized Twitter service. It’s all over the mainstream press and not just the tech blogs.</p>\n<p>A few things could happen in the next little bit that would have significant impacts on Twitter and Mastodon.</p>\n<p>1. The World Cup or another event brings back the fail whale – historically, large sporting events like the World Cup have put signficant strain on Twitter. Between the recent layoffs, firings and resignations, it’s possible that a significant event might lead to downtime. If Twitter goes down, there will be further and significant influx of users to Mastodon.</p>\n<p>2. Trump reinstated – Elon Musk could reinstate the account of Donald Trump. If Trump returns to Twitter, it may very well be “a last straw” for some users. Until recently, there wasn’t a viable option for them, but Mastodon is growing quickly and many of these users who quit Twitter will head to Mastodon. <em>UPDATE: Trump was reinstated not long after I posted this.</em></p>\n<p>3. Brands and celebrities join – a few brands have waded into Mastodon, and if Twitter continues to implode, more will follow. Similarly, some of the “nerd” celebrities have joined or moved to Mastodon. Mainstream celebrities will naturally follow if they see the platform grow.</p>\n<p>4. The media joins – Twitter is widely seen as a place to get realtime news and information. Right now Mastodon is not there yet, although as more users join, more info, videos and photos about significant events like storms, accidents, etc. will show up on Mastodon. If journalists and media outlets start to join, this will have a big impact on what kind of content can be found on Mastodon.</p>\n<p>5. Bots – there are a ton of bots on Twitter sharing weather warnings, earthquakes, news, quotes, and fun stuff. Mastodon welcomes bots and makes it easy for users to create them. There are already bots on Mastodon, but not the breadth of what’s available on Twitter.</p>\n<p>6. Apps and sites integrate Mastodon features – so many apps and websites have things like “Share to Twitter” built in. If Mastodon gets enough users, app makers and website owners will add “Share to Mastodon” making it far easier for users to quickly share content.</p>\n<p>Mastodon has very little control over these things. But <em>users</em> of Mastodon can have a big impact on adoption.</p>\n<p>We can quit Twitter and make a point of saying why we’re leaving and that we are going to Mastodon. We can push brands and celebrities to make the switch through tweets and encouragement. We can do the same for media outlets and journalists by suggesting they at least join Mastodon and cross-post. We can build bots to bring news, weather, alerts and other information to Mastodon. We can push app makers to add “Share to Mastodon” buttons and suggest to websites that they do likewise and we can add that functionality to our own sites.</p>\n<p>This is the best chance we have to bring the fediverse and Mastodon into the mainstream. It’s not going to be a single event that does it, but a series of events that are used to build momentum that will take it to critical mass. Once we get there, it’ll be unstoppable.</p>\n",
            "author": {
                "name": "James Koole"
            },
            "tags": [
                   "Open Web"
            ],
            "date_published": "2022-11-19T12:51:00-05:00",
            "date_modified": "2023-02-28T14:42:54-05:00"
        }
    ]
}
