{
    "version": "https://jsonfeed.org/version/1",
    "title": "James Koole",
    "description": "",
    "home_page_url": "https://www.jameskoole.com",
    "feed_url": "https://www.jameskoole.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "James Koole"
    },
    "items": [
        {
            "id": "https://www.jameskoole.com/day-trips-to-run/",
            "url": "https://www.jameskoole.com/day-trips-to-run/",
            "title": "Day Trips to Run ",
            "summary": "We were chatting after our long Sunday run recently and the subject of travel to run or race came up.",
            "content_html": "<p>We were chatting after our long Sunday run recently and the subject of travel to run or race came up. We always talk about various races and cities that we’d like to visit to run in. This time we started thinking about the economics of just going somewhere for the day to run, vs. going for a few days to do a race.</p>\n<p>Part of this was spurred by the fact I had strongly considered taking the train to Ottawa a couple of weeks ago simply to go for a long run in a different place. The plan I had included hopping the VIA Rail train out in the morning, taking the OTrain downtown, going for a 21km run and then returning to Toronto the same way via OTrain and VIA Rail.</p>\n<p>Total cost for that trip would have been about $250 including the train tickets, transit and a meal or two somewhere along the way in Ottawa. Not bad, honestly.</p>\n<p>We started thinking about whether it would make sense to go further afield and really push things a bit more. I suggested Montreal or Quebec City, but Miguel was thinking further - Halifax. My method of transportation was generally the train, but the time spent on our not-so-fast corridor services with VIA Rail really eats into the day. Flights, on the other hand…</p>\n<p>Depending on the day, we could fly Toronto to Halifax for about $230 return. That would be about the same cost as my Ottawa trip, but quite a different experience. Flying from the downtown airport in Toronto would mean we could easily get there on transit for a couple of bucks.</p>\n<p>The Halifax side would be a bit more complicated, but if three or four of us went, splitting a cab or Uber from the airport to downtown wouldn’t be too expensive. If we grabbed the first flight of the day, we could be in downtown Halifax by just after noon local time. A two hour run around town would have us back in time for a late lunch/early dinner somewhere and plenty of time to catch a 7:25 P.M. back to Toronto around 10:15 P.M.</p>\n<p>Total spend on a trip like that would be something like $350 per person which is far less than a marathon race weekend would cost. The key to this would be finding a cheap flight and avoiding an overnight stay. Something to think about for sure!</p>\n",
            "author": {
                "name": "James Koole"
            },
            "tags": [
                   "Running"
            ],
            "date_published": "2023-02-20T12:51:00-05:00",
            "date_modified": "2023-02-28T12:57:02-05:00"
        },
        {
            "id": "https://www.jameskoole.com/switching-instances/",
            "url": "https://www.jameskoole.com/switching-instances/",
            "title": "Switching Instances",
            "summary": "I started out on mastodon.social back in 2018 and sometime after that, deleted my account. I re-created it in March,&hellip;",
            "content_html": "<p>I started out on mastodon.social back in 2018 and sometime after that, deleted my account. I re-created it in March, 2022 when the drama with Elon and Twitter started. When I quit Twitter late in the fall, I decided to move to a smaller instance for a variety of reasons.</p>\n<p>That instance was <a href=\"https://indieweb.social\">indieweb.social</a> and I opted for that instance because I liked the community there which seemed aligned with my thoughts on the open web. The local feed was one of the best parts of being on that instance for first little while. It was not exclusively about open/indieweb topics, but it sure leaned that way.</p>\n<p>But as the instance grew, the indieweb part seemed to fade quite a bit. And I wasn’t helping either. My posts tended to be more about running than indieweb stuff which left me wondering if I belonged there. The value of the local feed was diminishing a bit for me and I started considering a move either to a new instance or back to mastodon.social.</p>\n<p>I thought about going to <a href=\"https://mstdn.ca\">mstdn.ca</a> (the “Canadian” instance) and also about going to the corporate instance my employer runs. But the more I thought about it, the more sense it made to head to <a href=\"https://mastodon.social\">mastodon.social</a>.</p>\n<p>Earlier today I <a href=\"https://mastodon.social/@jameskoole\">made the switch back</a> with the migration tool and redirect feature that Mastodon offers. It all worked pretty nicely, although I had to manually recreate some filters. My old profile on indieweb.social is redirecting and I set it to delete posts over 6 months old so by the summer it’ll be blank and I can probably just delete it.</p>\n",
            "author": {
                "name": "James Koole"
            },
            "tags": [
                   "Open Web"
            ],
            "date_published": "2023-02-09T20:56:00-05:00",
            "date_modified": "2023-02-28T12:56:54-05:00"
        },
        {
            "id": "https://www.jameskoole.com/thanks-elon/",
            "url": "https://www.jameskoole.com/thanks-elon/",
            "title": "Thanks Elon!",
            "summary": "I’m not really surprised. In fact, I’m surprised it took this long. Back when Elon bought Twitter, one of the&hellip;",
            "content_html": "<p>I’m not really surprised. In fact, I’m surprised it took this long.</p>\n<p>Back when Elon bought Twitter, one of the first things I did was to start using the official iOS Twitter app. I kept <a href=\"https://tapbots.com/tweetbot/\">Tweetbot</a> on my phone, but I used Twitter instead full-time because my assumption was that at some point third-party apps were going to be banned.</p>\n<p>My use of the official Twitter app was fairly short-lived. The app sucks, to be quite frank. The algorithmic timeline is completely terrible and the injection of ads and sponsored tweets made it even worse. Even the act of composing a tweet was subpar.</p>\n<p>I had been a Tweetbot user for the better part of a decade. To me, Tweetbot was Twitter. The chronological timeline, free of ads, and consisting entirely of the tweets and retweets of the people I followed and nothing else, was the epitome of the Twitter experience.</p>\n<p>But good old Elon has decided that Tweetbot and all the rest of the third-party apps must go! Perhaps he’s jealous of the higher quality of Tweetbot, <a href=\"https://twitterrific.com/beyond\">Twitterrific</a> and others. Whatever the case, Tweetbot is cut off at the API and dead. RIP.</p>\n<h3 id=\"enter-mastodon\">Enter Mastodon</h3>\n<p>Fortunately, I stopped using Tweetbot months ago when I deactivated my Twitter account in favour of Mastodon. I was lucky that I had started following <a href=\"http://@paul@tapbots.social\">Paul</a> and <a href=\"@mark@tapbots.social\">Mark</a> from <a href=\"https://www.tapbots.com\">Tapbots</a> on Mastodon mostly so I could stay up-to-date on the happenings with Twitter and Tweetbot.</p>\n<p>I figured the first place that I would learn about the death of third-party apps at the hand of Elon would be from the Tweetbot people. The fact they had gone to the trouble of setting up a <a href=\"https://tapbots.social\">Mastodon instance for Tapbots</a> was a very good sign that something was brewing.</p>\n<p>More fortunately, I was able to get one of the few TestFlight slots on the very first day that their new app, Ivory for Mastodon, was revealed. It felt instantly like home. It was Tweetbot-like, but still true to Mastodon - familiar, but different and not at all in an uncanny-valley way.</p>\n<p><a href=\"https://tapbots.com/ivory/\">Ivory</a> is wildly good. Along with the recent influx of the tech community into Mastodon, the existence of Ivory has made the transition from Twitter to Mastodon quite easy.</p>\n<h3 id=\"you-waited-too-long-elon\">You Waited Too Long, Elon</h3>\n<p>I shudder to think of what things would be like if Mastodon wasn’t a thing and if new apps like Ivory weren’t around. Quitting Twitter was made far more palatable because there was a viable alternative.</p>\n<p>Perhaps the biggest mistake that Elon made was waiting too long to kill off the third-party apps. By the time he pulled the trigger last week, we all knew Ivory was on the way and the momentum was quickly building on Mastodon.</p>\n<h3 id=\"back-in-time\">Back in Time</h3>\n<p>In many ways it feels like we’ve been transported back in time about 10 or 12 years to when Twitter was new and the web was still a place where we all built our own sites and blogs. Mastodon has rekindled that sense in a lot of people of late. We watched as wall-gardens were built up and destroyed the indie web that we all loved.</p>\n<p>But now we have a chance to do it all over again and do it right. Mastodon is like Twitter, but built on open standards and federated. People are thinking about blogging again and bringing back their sites on their own domain names.</p>\n<p>I’m starting to really question whether the remaining walled gardens are something I’m willing to continue to contribute my content and attention to. I’ve all but quit Instagram and haven’t used Facebook in years and years. I don’t have a TikTok and don’t plan to get one anytime soon.</p>\n<p>Maybe the best thing to come out of Elon buying Twitter is that those of us who adopted Twitter back in the early days will be reminded of what we loved about the web back then. Will Elon kill Twitter completely? Probably not. But does it really matter anymore?</p>\n<p>He’s already done enough to drive the nerds and internet junkies over to Mastodon. The indie devs are excitedly building apps that leverage open APIs and can’t be shut down by one stupid childish man. It’s the return of the internet we all knew and loved.</p>\n<p>And for that, I say “thank you” to Elon. You deserve none of the credit for your own ineptitude, but the internet thanks you anyway.</p>\n",
            "author": {
                "name": "James Koole"
            },
            "tags": [
                   "Open Web"
            ],
            "date_published": "2023-01-20T12:54:00-05:00",
            "date_modified": "2023-02-28T12:56:45-05:00"
        },
        {
            "id": "https://www.jameskoole.com/algos-photos-and-social/",
            "url": "https://www.jameskoole.com/algos-photos-and-social/",
            "title": "Algos, Photos and Social",
            "summary": "It looks like Twitter (aka Elon) killed off most third-party apps the other day. That’s not a big deal for&hellip;",
            "content_html": "<p>It looks like Twitter (aka Elon) killed off most third-party apps the other day. That’s not a big deal for me since I quit using Twitter a few weeks back. The goal appears to be to push all users to the Twitter iOS app and to push the algorithmic timeline over the chronological one.</p>\n<p>Over on Instagram, the same thing has happened except there aren’t any third-party apps to kill off. The algorithmic timeline is king and that has me really considering dropping Instagram from my life as well.</p>\n<p>I have two accounts on Insta. My <a href=\"https://www.instagram.com/jameskooleto/\">personal account</a> I use to follow some friends and occasionally I’ll follow some accounts to get me hyped up for a vacation or event. For example, I added a bunch of photographers from in and around the Canmore and Banff areas recently ahead of our trip there over the Christmas break.</p>\n<p>I have <a href=\"https://www.instagram.com/tracksidetoronto/\">another account</a> that I used to use to post my rail photography. That account has something like 750 followers but I haven’t done much with it lately since I haven’t been out to do much rail photography really since the start of the pandemic.</p>\n<p>The problem with Instagram is that a few years ago they decided that users should be seeing more than just the photos their friends are posting. That “more” includes ads, suggested posts and recently, Reels.</p>\n<p>I mostly don’t care about the ads or Reels and Instagram is pretty bad at suggesting posts. It’s all junk. The real issue is that Meta needs to make more money and it’s pushing more of the crap I don’t want at me and less of the photos that I do want to see.</p>\n<p>Opening the Instagram app now is mostly a waste of time. I might see a new photo from a friend, although it’s more likely going to be a “story”. I will for sure see a crap load of suggested posts, a crap load of ads and a bunch of Reels that I don’t care about.</p>\n<h3 id=\"what-about-pixelfed\">What About PixelFed?</h3>\n<p>Some have suggested <a href=\"https://pixelfed.org\">PixelFed</a> as the solution. I’ve tried PixelFed but there are a few problems with it, from my perspective.</p>\n<ol>\n<li>They are trying to mimic Instagram. The app (in beta) is basically a rip-off of the Instagram UI. They also <a href=\"https://pixelfed.social\">don’t allow browsing without an account</a> which is user-hostile and a dark pattern to get users to create an account. Gross.</li>\n<li>Nobody I know uses it. The content on PixelFed is okay, but the reason I used Instagram was to see photos from my friends. They aren’t on PixelFed.</li>\n</ol>\n<p>I could post photos to PixelFed and try and get some friends to hop on as well. There’s a chicken and egg thing there for sure. But is that going to be successful? I don’t know.</p>\n<h3 id=\"how-about-mastodon\">How About Mastodon?</h3>\n<p>I could also just post my photos to Mastodon now and then and thanks to the wonders of ActivityPub and federation, I can just follow PixelFed users in Ivory or on the web version of Mastodon.</p>\n<p>Most likely I’m going to stop bothering with Instagram and start posting more photos either directly to Mastodon or to my blog (and then linked on Mastodon). I think the single, federated account is the right way to go for me with posts that are test, photos and links.</p>\n",
            "author": {
                "name": "James Koole"
            },
            "tags": [
                   "Open Web"
            ],
            "date_published": "2023-01-14T15:21:00-05:00",
            "date_modified": "2023-02-28T12:56:38-05:00"
        }
    ]
}
